This file will have the following format:

?- Query(X). (input)
solution1 ; (output1)
solution2 ; (output2)
... ;
no   (output_n)
or
yes (output_n)

-----------------------------------

1. 

?- brother(rod,X).
X = todd ? ;

no

?- sister(marge,X).
X = patty ? ;

X = selma

yes

?- aunt(X,patty).
X = bart ? ;

X = lisa ? ;

X = maggie ? ;

no

?- uncle(bart,X).
X = herb ? ;

no

?- grandfather(maggie,X).
X = abraham ? ;

no

?- granddaughter(jackie,D).
D = maggie ? ;

D = lisa ? ;

(15 ms) no

?- ancestor(bart,X).
X = homer ? ;

X = marge ? ;

X = abraham ? ;

X = jackie ? ;

no


2.
?- query2a(X).
X = sam ? ;

X = bill ? ;

X = joan ? ;

no

?- query2b(X).
X = lance ? ;

no

?- query2c(X).
X = lisa ? ;

X = charlie ? ;

(16 ms) no


3.
?- canTeach(X,Y).
X = bill
Y = organic ? ;

X = bill
Y = inorganic ? ;

X = susan
Y = algebra ? ;

X = susan
Y = calculus ? ;

no

?- canTeach2(X,Y).
X = susan
Y = algebra ? ;

X = susan
Y = calculus ? ;

no

?- canTeach3(X,Y).
X = susan
Y = algebra ? ;

X = susan
Y = calculus ? ;

X = chuck
Y = dynamics ? ;

X = chuck
Y = electromagnetism ? ;

X = chuck
Y = nuclear ? ;

no


4.
?- octal_code(A,B,C).
000

A = 0
B = 0
C = 0 ? ;
001

A = 0
B = 0
C = 1 ? ;
010

A = 0
B = 1
C = 0 ? ;
011

A = 0
B = 1
C = 1 ? ;
100

A = 1
B = 0
C = 0 ? ;
101

A = 1
B = 0
C = 1 ? ;
110

A = 1
B = 1
C = 0 ? ;
111

A = 1
B = 1
C = 1

yes


5.
?- mapcolor(WA,NT,SA,Q,NSW,V,T).
WA = red, NT = green, SA = blue, Q = red, NSW = green, V = red, T = red

NSW = green
NT = green
Q = red
SA = blue
T = red
V = red
WA = red ? ;
WA = red, NT = green, SA = blue, Q = red, NSW = green, V = red, T = green

NSW = green
NT = green
Q = red
SA = blue
T = green
V = red
WA = red ? ;
WA = red, NT = green, SA = blue, Q = red, NSW = green, V = red, T = blue

NSW = green
NT = green
Q = red
SA = blue
T = blue
V = red
WA = red ? ;
WA = red, NT = blue, SA = green, Q = red, NSW = blue, V = red, T = red

NSW = blue
NT = blue
Q = red
SA = green
T = red
V = red
WA = red ? ;
WA = red, NT = blue, SA = green, Q = red, NSW = blue, V = red, T = green

NSW = blue
NT = blue
Q = red
SA = green
T = green
V = red
WA = red ? ;
WA = red, NT = blue, SA = green, Q = red, NSW = blue, V = red, T = blue

NSW = blue
NT = blue
Q = red
SA = green
T = blue
V = red
WA = red ? ;
WA = green, NT = red, SA = blue, Q = green, NSW = red, V = green, T = red

NSW = red
NT = red
Q = green
SA = blue
T = red
V = green
WA = green ? ;
WA = green, NT = red, SA = blue, Q = green, NSW = red, V = green, T = green

NSW = red
NT = red
Q = green
SA = blue
T = green
V = green
WA = green ? ;
WA = green, NT = red, SA = blue, Q = green, NSW = red, V = green, T = blue

NSW = red
NT = red
Q = green
SA = blue
T = blue
V = green
WA = green ? ;
WA = green, NT = blue, SA = red, Q = green, NSW = blue, V = green, T = red

NSW = blue
NT = blue
Q = green
SA = red
T = red
V = green
WA = green ? ;
WA = green, NT = blue, SA = red, Q = green, NSW = blue, V = green, T = green

NSW = blue
NT = blue
Q = green
SA = red
T = green
V = green
WA = green ? ;
WA = green, NT = blue, SA = red, Q = green, NSW = blue, V = green, T = blue

NSW = blue
NT = blue
Q = green
SA = red
T = blue
V = green
WA = green ? ;
WA = blue, NT = red, SA = green, Q = blue, NSW = red, V = blue, T = red

NSW = red
NT = red
Q = blue
SA = green
T = red
V = blue
WA = blue ? ;
WA = blue, NT = red, SA = green, Q = blue, NSW = red, V = blue, T = green

NSW = red
NT = red
Q = blue
SA = green
T = green
V = blue
WA = blue ? ;
WA = blue, NT = red, SA = green, Q = blue, NSW = red, V = blue, T = blue

NSW = red
NT = red
Q = blue
SA = green
T = blue
V = blue
WA = blue ? ;
WA = blue, NT = green, SA = red, Q = blue, NSW = green, V = blue, T = red

NSW = green
NT = green
Q = blue
SA = red
T = red
V = blue
WA = blue ? ;
WA = blue, NT = green, SA = red, Q = blue, NSW = green, V = blue, T = green

NSW = green
NT = green
Q = blue
SA = red
T = green
V = blue
WA = blue ? ;
WA = blue, NT = green, SA = red, Q = blue, NSW = green, V = blue, T = blue

NSW = green
NT = green
Q = blue
SA = red
T = blue
V = blue
WA = blue ? ;

(31 ms) no


?- WA = green, mapcolor(WA, NT, SA, Q, NSW, V, T).
WA = green, NT = red, SA = blue, Q = green, NSW = red, V = green, T = red

NSW = red
NT = red
Q = green
SA = blue
T = red
V = green
WA = green ? ;
WA = green, NT = red, SA = blue, Q = green, NSW = red, V = green, T = green

NSW = red
NT = red
Q = green
SA = blue
T = green
V = green
WA = green ? ;
WA = green, NT = red, SA = blue, Q = green, NSW = red, V = green, T = blue

NSW = red
NT = red
Q = green
SA = blue
T = blue
V = green
WA = green ? ;
WA = green, NT = blue, SA = red, Q = green, NSW = blue, V = green, T = red

NSW = blue
NT = blue
Q = green
SA = red
T = red
V = green
WA = green ? ;
WA = green, NT = blue, SA = red, Q = green, NSW = blue, V = green, T = green

NSW = blue
NT = blue
Q = green
SA = red
T = green
V = green
WA = green ? ;
WA = green, NT = blue, SA = red, Q = green, NSW = blue, V = green, T = blue

NSW = blue
NT = blue
Q = green
SA = red
T = blue
V = green
WA = green ? ;

(15 ms) no


?- WA=red, Q=green, mapcolor(WA,NT,SA,Q,NSW,V,T).

no